stevenj/avr-libc3/include/avr/io/attiny10.h
/*
--------------------------------------------------------------------------------
WDT - Watchdog Timer
--------------------------------------------------------------------------------
*/


/* Watchdog Timer Interrupt Flag */
#define WDT_WDIF_CLEAR_gc (0x00) /* Watchdog Timer Interrupt Flag - CLEAR */
#define WDT_WDIF_SET_gc   (0x80) /* Watchdog Timer Interrupt Flag - SET */


/* Watchdog Timer Interrupt Enable */
#define WDT_WDIE_CLEAR_gc (0x00) /* Watchdog Timer Interrupt Enable - CLEAR */
#define WDT_WDIE_SET_gc   (0x40) /* Watchdog Timer Interrupt Enable - SET */


/* Watchdog Timer Prescaler Bits */
#define WDT_WDP_VAL_0x00_gc (0x00) /* Oscillator Cycles 2K */
#define WDT_WDP_VAL_0x01_gc (0x01) /* Oscillator Cycles 4K */
#define WDT_WDP_VAL_0x02_gc (0x02) /* Oscillator Cycles 8K */
#define WDT_WDP_VAL_0x03_gc (0x03) /* Oscillator Cycles 16K */
#define WDT_WDP_VAL_0x04_gc (0x04) /* Oscillator Cycles 32K */
#define WDT_WDP_VAL_0x05_gc (0x05) /* Oscillator Cycles 64K */
#define WDT_WDP_VAL_0x06_gc (0x06) /* Oscillator Cycles 128K */
#define WDT_WDP_VAL_0x07_gc (0x07) /* Oscillator Cycles 256K */
#define WDT_WDP_VAL_0x08_gc (0x08) /* Oscillator Cycles 512K */
#define WDT_WDP_VAL_0x09_gc (0x09) /* Oscillator Cycles 1024K */


/* Watch Dog Enable */
#define WDT_WDE_CLEAR_gc (0x00) /* Watch Dog Enable - CLEAR */
#define WDT_WDE_SET_gc   (0x08) /* Watch Dog Enable - SET */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE        _SFR_MEM8 (0x0000) /* ADC Base Address */
#define ADC_DIDR0       _SFR_MEM8 (0x0017) /* Digital Input Disable Register */
#define ADC_ADCL        _SFR_MEM8 (0x0019) /* ADC Data Register */
#define ADC_ADMUX       _SFR_MEM8 (0x001B) /* The ADC multiplexer Selection Register */
#define ADC_ADCSRB      _SFR_MEM8 (0x001C) /* The ADC Control and Status register B */
#define ADC_ADCSRA      _SFR_MEM8 (0x001D) /* The ADC Control and Status register A */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE         _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_DIDR0        _SFR_MEM8 (0x0017) 
#define AC_ACSR         _SFR_MEM8 (0x001F) /* Analog Comparator Control And Status Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_NVMCSR      _SFR_MEM8 (0x0032) /* Non-Volatile Memory Control and Status Register */
#define CPU_NVMCMD      _SFR_MEM8 (0x0033) /* Non-Volatile Memory Command */
#define CPU_VLMCSR      _SFR_MEM8 (0x0034) /* Vcc Level Monitoring Control and Status Register */
#define CPU_PRR         _SFR_MEM8 (0x0035) /* Power Reduction Register */
#define CPU_CLKPSR      _SFR_MEM8 (0x0036) /* Clock Prescale Register */
#define CPU_CLKMSR      _SFR_MEM8 (0x0037) /* Clock Main Settings Register */
#define CPU_OSCCAL      _SFR_MEM8 (0x0039) /* Oscillator Calibration Value */
#define CPU_SMCR        _SFR_MEM8 (0x003A) /* Sleep Mode Control Register */
#define CPU_RSTFLR      _SFR_MEM8 (0x003B) /* Reset Flag Register */
#define CPU_CCP         _SFR_MEM8 (0x003C) /* Configuration Change Protection */
#define CPU_SP          _SFR_MEM16(0x003D) /* Stack Pointer  */
#define CPU_SPL         _SFR_MEM8 (0x003D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH         _SFR_MEM8 (0x003E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG        _SFR_MEM8 (0x003F) /* Status Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE     _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB     _SFR_MEM8 (0x0000) /* Port B Data register */
#define PORTBB_DDRB     _SFR_MEM8 (0x0001) /* Data Direction Register, Port B */
#define PORTBB_PORTB    _SFR_MEM8 (0x0002) /* Input Pins, Port B */
#define PORTBB_PUEB     _SFR_MEM8 (0x0003) /* Pull-up Enable Control Register */
#define PORTBB_PORTCR   _SFR_MEM8 (0x000C) /* Port Control Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK     _SFR_MEM8 (0x0010) /* Pin Change Mask Register */
#define EXINT_PCIFR     _SFR_MEM8 (0x0011) /* Pin Change Interrupt Flag Register */
#define EXINT_PCICR     _SFR_MEM8 (0x0012) /* Pin Change Interrupt Control Register */
#define EXINT_EIMSK     _SFR_MEM8 (0x0013) /* External Interrupt Mask register */
#define EXINT_EIFR      _SFR_MEM8 (0x0014) /* External Interrupt Flag register */
#define EXINT_EICRA     _SFR_MEM8 (0x0015) /* External Interrupt Control Register A */

/* TC0 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE       _SFR_MEM16(0x0000) /* TC16 Base Address */
#define TC16_ICR0       _SFR_MEM16(0x0022) /* Input Capture Register  Bytes */
#define TC16_ICR0L      _SFR_MEM8 (0x0022) /* Input Capture Register  Bytes LOW BYTE */
#define TC16_ICR0H      _SFR_MEM8 (0x0023) /* Input Capture Register  Bytes HIGH BYTE */
#define TC16_OCR0B      _SFR_MEM16(0x0024) /* Timer/Counter0 Output Compare Register B  */
#define TC16_OCR0BL     _SFR_MEM8 (0x0024) /* Timer/Counter0 Output Compare Register B  LOW BYTE */
#define TC16_OCR0BH     _SFR_MEM8 (0x0025) /* Timer/Counter0 Output Compare Register B  HIGH BYTE */
#define TC16_OCR0A      _SFR_MEM16(0x0026) /* Timer/Counter 0 Output Compare Register A  */
#define TC16_OCR0AL     _SFR_MEM8 (0x0026) /* Timer/Counter 0 Output Compare Register A  LOW BYTE */
#define TC16_OCR0AH     _SFR_MEM8 (0x0027) /* Timer/Counter 0 Output Compare Register A  HIGH BYTE */
#define TC16_TCNT0      _SFR_MEM16(0x0028) /* Timer/Counter0  */
#define TC16_TCNT0L     _SFR_MEM8 (0x0028) /* Timer/Counter0  LOW BYTE */
#define TC16_TCNT0H     _SFR_MEM8 (0x0029) /* Timer/Counter0  HIGH BYTE */
#define TC16_TIFR0      _SFR_MEM8 (0x002A) /* Overflow Interrupt Enable */
#define TC16_TIMSK0     _SFR_MEM8 (0x002B) /* Timer Interrupt Mask Register 0 */
#define TC16_TCCR0C     _SFR_MEM8 (0x002C) /* Timer/Counter 0 Control Register C */
#define TC16_TCCR0B     _SFR_MEM8 (0x002D) /* Timer/Counter 0 Control Register B */
#define TC16_TCCR0A     _SFR_MEM8 (0x002E) /* Timer/Counter 0 Control Register A */
#define TC16_GTCCR      _SFR_MEM8 (0x002F) /* General Timer/Counter Control Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE        _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR      _SFR_MEM8 (0x0031) /* Watchdog Timer Control and Status Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_BYTE0      _SFR_MEM8 (0x0000) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

